\begin{lstlisting}[language=Scheme]
scm> (define a 3)               ; a = 3
a
scm> a
3
scm> (define (foo x) x)         ; procedure named foo
foo
scm> (foo a)
3
\end{lstlisting}